IDEA StatiCa Open Model
ReferenceElement Constructor (OpenElementId)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Constructor
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement(
	OpenElementId element
)
Public Sub New (
	element As OpenElementId
)
public:
ReferenceElement(
	OpenElementId^ element
)
Parameters
element
Type: IdeaRS.OpenModel.OpenElementId
Referenced element
See Also
Reference
ReferenceElement Class
ReferenceElement Overload
IdeaRS.OpenModel Namespace